In [1]:
import numpy as np 
import pandas as pd

In [2]:
df1 = pd.DataFrame({'employee':['Bob','Jake','Lisa','Sue'],'group':['A','B','B','C']})
df2 = pd.DataFrame({'employee':['Lisa','Bob','Jake','Sue'],'hire_date':[2004,2008,2012,2014]})
print(df1)
print(df2)
df3 = pd.merge(df1,df2)
df3

  employee group
0      Bob     A
1     Jake     B
2     Lisa     B
3      Sue     C
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

  employee group  hire_date
0      Bob     A       2008
1     Jake     B       2012
2     Lisa     B       2004
3      Sue     C       2014

In [3]:
# many-to-one
df4 = pd.DataFrame({'group':['A','B','C'],'supervisor':['Carly','Guido','Steve']})
print(df4)
df3.merge(df4)

  group supervisor
0     A      Carly
1     B      Guido
2     C      Steve

  employee group  hire_date supervisor
0      Bob     A       2008      Carly
1     Jake     B       2012      Guido
2     Lisa     B       2004      Guido
3      Sue     C       2014      Steve

In [4]:
# many-to-many
df5 = pd.DataFrame({'group':['A','A','B','B','C','C'],'skill':['math','coding','nothing','lazy','sleeping','writing']})
print(df5)
pd.merge(df1,df5)

  group     skill
0     A      math
1     A    coding
2     B   nothing
3     B      lazy
4     C  sleeping
5     C   writing

  employee group     skill
0      Bob     A      math
1      Bob     A    coding
2     Jake     B   nothing
3     Jake     B      lazy
4     Lisa     B   nothing
5     Lisa     B      lazy
6      Sue     C  sleeping
7      Sue     C   writing

In [5]:
# merge key: On
print(df1)
print(df2)
pd.merge(df1,df2,on='employee')

  employee group
0      Bob     A
1     Jake     B
2     Lisa     B
3      Sue     C
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

  employee group  hire_date
0      Bob     A       2008
1     Jake     B       2012
2     Lisa     B       2004
3      Sue     C       2014

In [6]:
# join on the different key name
df6 = pd.DataFrame({'name':['Bob','Jake','Lisa','Sue'],'salary':[7000,9000,12000,90000]})
print(df1)
print(df6)
pd.merge(df1,df6,left_on='employee',right_on='name')

  employee group
0      Bob     A
1     Jake     B
2     Lisa     B
3      Sue     C
   name  salary
0   Bob    7000
1  Jake    9000
2  Lisa   12000
3   Sue   90000

  employee group  name  salary
0      Bob     A   Bob    7000
1     Jake     B  Jake    9000
2     Lisa     B  Lisa   12000
3      Sue     C   Sue   90000

In [7]:
pd.merge(df1,df6,left_on='employee',right_on='name').drop('name',axis=1)

  employee group  salary
0      Bob     A    7000
1     Jake     B    9000
2     Lisa     B   12000
3      Sue     C   90000

In [8]:
# set_index
print(df1)
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
print(df1a)

  employee group
0      Bob     A
1     Jake     B
2     Lisa     B
3      Sue     C
         group
employee
Bob          A
Jake         B
Lisa         B
Sue          C

In [9]:
# left_index right_on, 
pd.merge(df1a,df6, left_index=True, right_on='name')

  group  name  salary
0     A   Bob    7000
1     B  Jake    9000
2     B  Lisa   12000
3     C   Sue   90000

In [10]:
# left_on right_index
pd.merge(df6,df1a, right_index=True, left_on='name')

   name  salary group
0   Bob    7000     A
1  Jake    9000     B
2  Lisa   12000     B
3   Sue   90000     C

In [11]:
# default (how='inner') 
df7 = pd.DataFrame({'name':['Peter','Paul','Mary'],'food':['fish','beans','bread']})
df8 = pd.DataFrame({'name':['Mary','John'],'drink':['wine','bear']})
pd.merge(df7,df8)

   name   food drink
0  Mary  bread  wine

In [12]:
# inner join
pd.merge(df7,df8, how='inner')

   name   food drink
0  Mary  bread  wine

In [14]:
# outer join
pd.merge(df7,df8,how='outer')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine
3   John    NaN  bear

In [16]:
# right join
pd.merge(df7,df8,how='right')

   name   food drink
0  Mary  bread  wine
1  John    NaN  bear

In [19]:
# left join
pd.merge(df7,df8,how='left')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [20]:
df9 = pd.DataFrame({'name':['Peter','Paul','Mary'],'rank':[1,2,3]})
df10 = pd.DataFrame({'name':['Peter','Paul','Mary'],'rank':[3,2,1]})
pd.merge(df9,df10, on='name')

    name  rank_x  rank_y
0  Peter       1       3
1   Paul       2       2
2   Mary       3       1